//! Метод includes()
//? Перевіряє, чи міститься підрядок в рядку, повертає буль - true, якщо міститься, і false - в іншому випадку.Регістр символів в рядку і підрядку має значення, оскільки, наприклад, літера "a" не дорівнює літері "А".

//* Перевірте чи юзер ввів емейл
//* в prompt() юзер вводить емайл якщо ця стрінга містить '@' та '.' ми виводимо меседж що перевірка успішна,якщо ні,то виводимо що перевірка не успішна

// let message = prompt("Enter your email address");

// if (message.includes("@") && message.includes(".")) {
//   console.log("Перевірка успішна");
// } else {
//   console.log("Перевірка не успішна");
// }

//todo Цей код перевіряє, чи введений вами текст містить символ "@" і символ ".". Якщо обидва символи присутні у введеному тексті, то виводиться повідомлення "Перевірка успішна". В іншому випадку виводиться повідомлення "Перевірка не успішна". Така перевірка може бути використана для перевірки, чи введений текст є коректною електронною адресою.
